Revit 2026 API

# IlluminationFailures Properties

---

The BuiltInFailuresIlluminationFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IESFileNotFoundWarning | Estimated Illumination failed. IES file not found for lighting fixture. |
|  | LightingFixtureLumensWarning | Estimated Illumination failed. Lumens not set for lighting fixture. |
|  | RoomCoefficientUtilizationWarning | Estimated Illumination failed. Coefficient of utilization not set for lighting fixture. |
|  | RoomLightLossFactorWarning | Estimated Illumination failed. Light Loss factor not set for lighting fixture. |

#### Reference

BuiltInFailuresIlluminationFailures Class

Autodesk.Revit.DB Namespace